# Лабараторная работа 2

**Задание 1.** Написать калькулятор с НЕБОЛЬШИМИ БАГАМИ

```python
def calculator():
    print("Добро пожаловать в калькулятор!")
    print("Доступные операции: +, -, *, /")
    print("Для выхода введите 'exit'")

    while True:
        # Получаем ввод от пользователя
        user_input = input("\nВведите выражение (например, 5 + 3): ")

        # Проверка на выход
        if user_input.lower() == 'exit':
            print("До свидания!")
            break

        try:
            # Разделяем ввод на части
            parts = user_input.split()
            if len(parts) != 3:
                print("Ошибка: введите выражение в формате 'число операция число'")
                continue

            num1 = float(parts[0])
            operator = parts[1]
            num2 = float(parts[2])

            # Выполняем операцию
            if operator == '+':
                result = num1 + num2
            elif operator == '-':
                result = num1 - num2
            elif operator == '*':
                result = num1 * num2
            elif operator == '/':
                if num2 == 0:
                    print("Ошибка: деление на ноль невозможно!")
                    continue
                result = num1 / num2
            else:
                print("Ошибка: неподдерживаемая операция. Используйте +, -, * или /")
                continue

            # Выводим результат
            print(f"Результат: {num1} {operator} {num2} = {result}")

        except ValueError:
            print("Ошибка: пожалуйста, введите корректные числа")
        except Exception as e:
            print(f"Произошла ошибка: {e}")

# Запускаем калькулятор
calculator()
```

## Таблица к заданию 1 (задание 2)

**Задание 2.** Обменяться программой с другими студентами. Провести тестирование (минимум 10 тестов) и написать отчет. Необходимо найти ошибки в работе ПС.

| № | Название теста | Описание сценария | Входные данные | Тестирование | Предложение по исправлению ошибок | Пожелания |
| 1 | Сложение целых чисел | Проверка суммы | 5 + 3 | Успешно | - | Добавить вывод без ,0 |
| 2 | Деление на 0 | Попытка деления на 0 | 5 / 0 | Попытка деления на 0 | - | - |
| 3 | Неверный формат ввода | Ввод без пробелов	| 5+3 | Ошибка: введите выражение в формате 'число операция число' | Использовать регулярные выражения для парсинга | Сделать парсинг более гибким |
| 4 | Отрицательные числа | Операция с отрицательным числом	| -5 * 2 | Успешно | - | - |
| 5 | Дробные числа | Сложение через точку | 2.5 + 2.5 | Успешно | - | - |
| 6 | Регистр команды EXIT | Завершение работы программы | EXIT | Успешно | - | - |
| 7 | Дробные через запятую | Ввод числа с запятой | 2,5 + 1 | Ошибка: пожалуйста, введите корректные числа | Добавить .replace(',', '.') перед конвертацией | Автоматически заменять запятые |
| 8 | Избыточные пробелы | Лишние пробелы между частями | 10 + 2 | Ошибка (split вернет пустые строки) | Использовать parts = [p for p in user_input.split() if p] | Игнорировать двойные пробелы |
| 9 | Нечисловой ввод | Ввод букв вместо цифр | a + b | Ошибка: пожалуйста, введите корректные числа | - | - |
| 10 | Пустой ввод | Нажатие Enter без ввода | (пусто) | Ошибка: введите выражение в формате 'число операция число' | Добавить проверку на пустую строку в начале | - |
